//UGB0RUNC JOB AF-1055,'RUN ASM',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//JOBLIB   DD  DSN=SDAF.P732083.NAMI.LOADLIB,
//             DISP=SHR
//*
//STEP001  EXEC PGM=ASPROG01
//SYSOUT   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSABEND DD  SYSOUT=*
//SYSDBOUT DD  SYSOUT=*
//SYSIN    DD  *
S0
/*
//
