//RUNDB2CO JOB AF-1055,'RUN DB2',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//JOBLIB   DD  DSN=SDAF.P732083.NAMI.LOADLIB,
//             DISP=SHR
//** COBOL DB2 RUN JCL
//STEP01 EXEC PGM=IKJEFT01,
//         DYNAMNBR=20
//*
//STEPLIB  DD  DISP=SHR,
//             DSN=SDAF.P732083.NAMI.LOADLIB
//*
//SYSTSPRT DD  SYSOUT=*
//SYSTSIN  DD  *
DSN SYSTEM(DB2)
    RUN PROGRAM(COBDB2) -
    PLAN(NAMI)
/*
//SYSOUT   DD  SYSOUT=*
//SYSIN    DD  *
//*
