//UGBIDCAM JOB AF-1055,'COUNTREC',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*TO COPY SELECTED NO OF RECORDS
//COPY001   EXEC  PGM=IDCAMS
//SYSOUT    DD    SYSOUT=*
//SYSPRINT  DD    SYSOUT=*
//INDD      DD    DSN=SDAF.NANI.IN1.SE,DISP=SHR
//OUTDD     DD    DSN=SDAF.NANI.OUT.SE,DISP=OLD
//SYSIN     DD    *
 REPRO INFILE(INDD)-
 OUTFILE(OUTDD)-
 SKIP(1)-
 COUNT(9)
/*
