//UGBIEBCP JOB AF-1055,'MERGE 2 PDS',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//COPY    EXEC PGM=IEBCOPY
//INFILE1  DD  DSN=SDAF.P732083.NAMI.JCL.CNTL,DISP=SHR
//INFILE2  DD  DSN=SDAF.P732083.NAMI.COBOL.LIBRARY,DISP=SHR
//OUTFILE  DD  DSN=SDAF.P732083.NAMI.JCL.CNTL.BAK,DISP=OLD
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 COPY OUTDD=OUTFILE,INDD=INFILE1,INFILE2
/*
