//UGBIEBGC JOB AF-1055,'COPY PS',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//COPY    EXEC PGM=IEBGENER
//SYSUT1   DD  DSN=SDAF.NANI.IN1.SE,DISP=SHR
//SYSUT2   DD  DSN=SDAF.NANI.OUT.SE,DISP=OLD
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
