//SORTCNT2 JOB AF-1055,'SORT CNT',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//SORT001 EXEC PGM=SORT
//SYSOUT   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//*INPUT FILE COUNT
//SORTIN   DD  DSN=SDAF.NANI.P732083.INPUT.SE,
//             DISP=SHR
//SORTOUT  DD  DSN=SDAF.NANI.OUT.SE,
//             DISP=OLD
//SYSIN    DD  *
 SORT FIELDS=COPY
 OUTFIL FILES=OUT,
    TRAILER1=(1:COUNT),REMOVECC,NODETAIL
/*
