//SORTDUP1 JOB AF-1055,'SORT DUP',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//SORT001   EXEC  PGM=SORT
//SYSOUT    DD    SYSOUT=*
//SYSPRINT  DD    SYSOUT=*
//SORTIN    DD    DSN=SDAF.NANI.P732083.INPUT.SE,DISP=SHR
//SORTOUT   DD    DSN=SDAF.NANI.SORTOUT.SE,DISP=OLD
//SYSIN     DD    *
 SORT FIELDS=(1,22,CH,A)
 SUM FIELDS=NONE
/*
