//UGBSORSK JOB AF-1055,'SORT SEQ',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//SORT001  EXEC PGM=SORT
//SORTIN   DD *
DATA1
DATA2
DATA3
/*
//SORTOUT  DD SYSOUT=*
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*
//SYSIN    DD *
 OPTION COPY
 OUTFIL  BUILD=(1:1,5,10:SEQNUM,4,ZD,START=1000,INCR=2)
/*
