       IDENTIFICATION DIVISION.
       PROGRAM-ID. MERGESTUDENTS.

       ENVIRONMENT DIVISION. 
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   SELECT STUDENTFILE ASSIGN TO "STUDENTS.DAT"
           FILE STATUS IS STUD-FILE-CHECK-KEY
		   ORGANIZATION IS LINE SEQUENTIAL.

	   SELECT NEWSTUDENTFILE ASSIGN TO "NEWSTUDENTS.DAT"
           FILE STATUS IS NEW-FILE-CHECK-KEY
	       ORGANIZATION IS LINE SEQUENTIAL.
    
       SELECT SORTEDFILE ASSIGN TO "STUDENTS.NEW"
           ORGANIZATION IS LINE SEQUENTIAL.
		
       SELECT WORKFILE ASSIGN TO "WORK.TMP".
	               
       DATA DIVISION.
       FILE SECTION.
	   FD STUDENTFILE.
	   01 STUDENTDETAILS     PIC X(40).
	
       FD NEWSTUDENTFILE.
	   01 NEWSTUDENTDETAILS  PIC X(40).
				
       FD SORTEDFILE.
	   01 SORTDETAILS        PIC X(40).	
				
       SD WORKFILE.
       01 WORKREC.
          	02 WSTUDENT-ID   PIC 9(7).
			02 WSTUDENTLNAME PIC X(10).
			02 WSTUDENTFNAME PIC X(10).
			02 FILLER        PIC X(9).
		    02 WMAJOR        PIC X(3).		  
            02 FILLER        PIC X.	   
   
       WORKING-STORAGE SECTION.
       01  WS-WORKING-STORAGE.
           05 FILLER      PIC X(27) VALUE 
		      'WORKING STORAGE STARTS HERE'.   
   
	   01  WS-WORK-AREAS.
	       05  STUD-FILE-CHECK-KEY   PIC X(2).
           05  NEW-FILE-CHECK-KEY    PIC X(2).
		 

       PROCEDURE DIVISION.
       0050-START.
           PERFORM 0100-READ-STUDENTS.
           PERFORM 9000-END-PROGRAM.
       0050-END.

       0100-READ-STUDENTS.

		   OPEN INPUT STUDENTFILE, NEWSTUDENTFILE.
		   				
		   MERGE WORKFILE ON ASCENDING KEY 
		      WSTUDENT-ID
		      USING STUDENTFILE 
			    NEWSTUDENTFILE
			  GIVING SORTEDFILE.
		   
	   0100-END.
	   
	   9000-END-PROGRAM.
           CLOSE STUDENTFILE, NEWSTUDENTFILE.    	 
                
           STOP RUN.         
          END PROGRAM MERGESTUDENTS.
