//UELT228C JOB NOTIFY=&SYSUID,REGION=0M                                 00010099
//*                                                                     00020099
//PROCLIB JCLLIB ORDER='ELTP.HYD.VENKAT.PROCLIB'                        00040099
//COBCL EXEC COBCL,SUBLIB=UELT228.ELTP1026.LOADLIB                      00070099
//COMPILE.SYSIN DD DSN=UELT228.ELTP1026.COBOL(DATDIFF),DISP=SHR         00080099
//COMPILE.SYSLIB DD DSN=UELT228.ELTP1026.COPYBOOK,DISP=SHR              00081099
//LKED.SYSLMOD DD DSN=UELT228.ELTP1026.LOADLIB(DATDIFF),DISP=SHR        00090099
