//ICECOPY1 JOB AF-1055,'ICETOOL CPY',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//ICE001 EXEC PGM=ICETOOL
//DFSMSG   DD  SYSOUT=*
//TOOLMSG  DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//IN1      DD  DSN=SDAF.NANI.P732083.INPUT.SE,
//             DISP=SHR
//OUT1     DD  DSN=SDAF.NANI.OUT.SE,
//             DISP=OLD
//OUT2     DD  DSN=SDAF.NANI.OUT2.SE,
//             DISP=OLD
//TOOLIN   DD  *
 COPY FROM(IN1) TO(OUT1,OUT2)
/*
