//ICETCNT1 JOB AF-1055,'ICETOOL CNT',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//ICE001 EXEC PGM=ICETOOL
//DFSMSG   DD  SYSOUT=*
//TOOLMSG  DD  SYSOUT=*
//SYSOUT   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//*INPUT FILE COUNT
//*INPUTFL  DD  DSN=SDAF.NANI.IN.SE,
//IN1      DD  DSN=SDAF.NANI.P732083.INPUT.SE,
//             DISP=SHR
//TOOLIN   DD  *
 COUNT FROM(IN1)
/*
