//ICEMAN01 JOB AF-1055,'ICEMAN',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//SORT001   EXEC  PGM=ICEMAN
//SYSOUT    DD    SYSOUT=*
//SYSPRINT  DD    SYSOUT=*
//SORTIN    DD    DSN=SDAF.NANI.P732083.INPUT.SE,DISP=SHR
//SORTOUT   DD    DSN=SDAF.NANI.SORTOUT.SE,DISP=OLD
//SORTWK01  DD    DISP=(NEW,DELETE),
//             UNIT=SYSDA,SPACE=(CYL,(3335,3335))
//SYSIN     DD    *
 OPTION COPY
 INREC FINDREP=(IN=C'HARI BABU',OUT=C'HARI SADU')
/*
