//IDCAMEMP JOB AF-1055,'EMPTY CHECK',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,
//             NOTIFY=&SYSUID
//*DELETES THE MEMBER EVEN IF PDS IS OPENED
//DEL0001   EXEC  PGM=IDCAMS
//SYSOUT    DD    SYSOUT=*
//SYSPRINT  DD    SYSOUT=*
//DD1       DD    DSN=SDAF.NANI.OUT.SE,DISP=SHR
//SYSIN     DD    *
 PRINT INFILE(DD1) CHARACTER COUNT(1)
/*
