//UGBIEBCP JOB AF-1055,'MERGE PDS',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//COPY    EXEC PGM=IEBCOPY
//INFILE   DD  DSN=SDAF.P732083.NAMI.JCL.CNTL,DISP=OLD
//OUTFILE  DD  DSN=SDAF.P732083.NAMI.JCL.CNTL.BAK,DISP=OLD
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  *
 COPY OUTDD=OUTFILE,INDD=INFILE
/*
