//CADELM9A JOB (CA-1114),'ASF FMF DELETIOM',
//             CLASS=A,
//             MSGCLASS=9,
//             REGION=4096K
//*
//DEL0001   EXEC  PGM=IEFBR14
//SYSOUT    DD    SYSOUT=*
//SYSPRINT  DD    SYSOUT=*
//INDD1     DD    DSN=CA.FL07846.CA040BA0,
//         DISP=(OLD,DELETE,DELETE)
//INDD2     DD    DSN=CA.FL07846.CA040BA0.SRT,
//         DISP=(OLD,DELETE,DELETE)
//INDD3     DD    DSN=CA.CA040BA0.NOTETEXT,
//         DISP=(OLD,DELETE,DELETE)
//
