//SUBJCL01 JOB AF-1055,'SUB JCL',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*SUBMIT JCL WITH SELECTIVE STEPS ONLY WITH IEBEDIT
//STEP1    EXEC PGM=IEBEDIT
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=SDAF.P732083.NAMI.JCL.CNTL(SAMPHEL2),DISP=SHR
//SYSUT2   DD SYSOUT=(*,INTRDR)
//SYSIN    DD *
 EDIT TYPE=INCLUDE,STEPNAME=(STEP004,STEP003,)
/*
