//SORTDATE JOB AF-1055,'SORT DATE',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//SORT001 EXEC PGM=SORT
//SYSOUT   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//*INPUT FILE COUNT
//SORTIN   DD  DSN=SDAF.PP42041.AF200.FL01755A.D140428,
//             DISP=SHR
//SORTOUT  DD  DSN=SDAF.NANI.OUT.SE,
//             DISP=OLD
//SYSIN    DD  *
 SORT FIELDS=COPY
 OUTREC BUILD=(32,4,PD,EDIT(TT/TT/TT),9:32X)
/*
//
 OUTREC FIELDS(32,4,PD,EDIT(TT/TT/TT))
