//SUBJCL01 JOB AF-1055,'SUB JCL',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*SUBMIT JCL
//SUBT001   EXEC  PGM=IEBGENER
//SYSUT1   DD   DSN=SDAF.P732083.NAMI.JCL.CNTL(SAMPHELL),DISP=SHR
//SYSUT2   DD   SYSOUT=(B,INTRDR)
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   DUMMY
