//SUBJCL02 JOB AF-1055,'SUB JCL',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*SUBMIT JCL
//SUBT001   EXEC  PGM=IKJEFT01
//SYSPROC  DD   DUMMY
//SYSTSPRT DD   SYSOUT=*
//SYSTSIN  DD   *
SUBMIT 'SDAF.P732083.NAMI.JCL.CNTL(SAMPHELL)'
SUBMIT 'SDAF.P732083.NAMI.JCL.CNTL(ICEMAN)'
/*
