//VSAMADDR JOB AF-1055,'RUN ASM',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//JOBLIB   DD  DSN=SDAF.P732083.NAMI.LOADLIB,
//             DISP=SHR
//*
//STEP001  EXEC PGM=VSAMADD
//INDDSE   DD  DSN=SDAF.P734013.JINE.SORT1.PD,DISP=SHR
//FL04702  DD  DSN=SDCA.TESTBED.MEVSAM.FL04702.WORK,DISP=MOD
//SYSOUT   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSABEND DD  SYSOUT=*
//SYSDBOUT DD  SYSOUT=*
//SYSIN    DD  *
/*
//
