01 STMTBUF.
  49 STMT-LEN PIC S9 (4) COMP.
  49 STMT-TXT PIC X (398).

MOVE ‘DELETE FROM UELA003.EMP_TBL01 WHERE EMP_NO='’	                                 TO STMT-TEXT.
	MOVE 50			 TO STMT-LEN.

EXEC-SQL
     DECLARE STMT STATEMENT (optional)
END-EXEC.

EXEC SQL
    PREPARE STMT
    FROM: STMTBUFF
END-EXE


Followed by:

EXEC SQL
    EXECUTE STMT
END-EXEC.

Or issue:

EXEC SQL
    EXECUTE IMMEDIATE STMT
    FROM: STMTBUFF
END-EXEC.
