       IDENTIFICATION DIVISION.
       PROGRAM-ID. INSERTEMPLOYEES.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT EMPLOYEEFILE ASSIGN TO "EMPLOYEEFILE.DAT"
           FILE STATUS IS EMPFILE-CHECK-KEY
	       ORGANIZATION IS LINE SEQUENTIAL.
		
       SELECT TRANSFILE ASSIGN TO "EMPTRANS.DAT"
           FILE STATUS IS TRANSFILE-CHECK-KEY 
           ORGANIZATION IS LINE SEQUENTIAL.		
       
       SELECT NEWEMPFILE ASSIGN TO "NEWEMPFILE.DAT"
           ORGANIZATION IS LINE SEQUENTIAL.
		
       SELECT OUTPUTFILE ASSIGN TO "ERRORREPORT.LPT"
 	       ORGANIZATION IS LINE SEQUENTIAL.   
           
               
       DATA DIVISION.
       FILE SECTION.
	   FD EMPLOYEEFILE.
	   01 EMPDETAILS.
			88 EMP-EOF VALUE HIGH-VALUES.
			02 EMPID  	     PIC 9(7).
            02 FILLER        PIC X(68).

       FD TRANSFILE.			
	   01 EMPTRANS.
			88 TRANS-EOF VALUE HIGH-VALUES.
			02 NEWEMPID  	 PIC 9(7).
			02 FILLER        PIC X(68).
		
       FD NEWEMPFILE.			
	   01 NEWEMPRECORD       PIC X(75).
					
       FD OUTPUTFILE.
	   01 PRINTLINE.
	      02 FILLER          PIC X(132).
   
       WORKING-STORAGE SECTION.
       01  WS-WORKING-STORAGE.
           05 FILLER      PIC X(27) VALUE 
		      'WORKING STORAGE STARTS HERE'.
     
       01  WS-DATE.
           05  WS-YEAR            PIC 99.
           05  WS-MONTH           PIC 99.
           05  WS-DAY             PIC 99.
		   
       01  WS-WORK-AREAS.
	       05  WS-SALARY-TOTAL     PIC 9(12) VALUE ZERO. 
           05  EMPFILE-CHECK-KEY   PIC X(2).
	       05  TRANSFILE-CHECK-KEY PIC X(2).

       01  HEADING-LINE.
           05 FILLER	        PIC X(30)  VALUE 
			   'DUPLICATE EMPID ERROR REPORT: '.
		   05 FILLER            PIC X(102)  VALUE SPACES.

			
	   01  DETAIL-LINE.
		   05 DET-EMP-ID       PIC 9(7).
		   05 FILLER           PIC X(125) VALUE SPACES.


       PROCEDURE DIVISION.
       0050-OPEN-FILES.
		   OPEN INPUT EMPLOYEEFILE
           IF EMPFILE-CHECK-KEY NOT = "00"
		      DISPLAY "ERR: OPEN FILE ERROR EMPFILE ",
				 EMPFILE-CHECK-KEY
		      GO TO 9000-END-PROGRAM
		   END-IF.
		   OPEN INPUT TRANSFILE
		   IF TRANSFILE-CHECK-KEY NOT = "00"
		      DISPLAY "ERR: OPEN FILE ERROR TRANSFILE ",
			     TRANSFILE-CHECK-KEY
		   END-IF.	 
		   OPEN OUTPUT OUTPUTFILE.
		   WRITE PRINTLINE FROM HEADING-LINE
		     AFTER ADVANCING 1 LINE.
			 
		   OPEN OUTPUT NEWEMPFILE.
           
       0050-END.

       0100-READ-EMPLOYEES.
		   
		   READ EMPLOYEEFILE
			AT END SET EMP-EOF TO TRUE
			END-READ.
			
		   READ TRANSFILE 
		    AT END SET TRANS-EOF TO TRUE
			END-READ.
			
		   PERFORM 0200-PROCESS-EMPLOYEES UNTIL 
		      (EMP-EOF) AND (TRANS-EOF).
		   		   
		   PERFORM 9000-END-PROGRAM.
		   
	   0100-END.
	   
	   0200-PROCESS-EMPLOYEES.
	        EVALUATE TRUE
			  WHEN(EMPID<NEWEMPID)
			    WRITE NEWEMPRECORD FROM EMPDETAILS
				  READ EMPLOYEEFILE 
				    AT END SET EMP-EOF TO TRUE
				  END-READ
				  
			  WHEN (EMPID>NEWEMPID)
			    WRITE NEWEMPRECORD FROM EMPTRANS 
				  READ TRANSFILE
				    AT END SET TRANS-EOF TO TRUE
			      END-READ 
		  
			  WHEN (EMPID = NEWEMPID)
                 MOVE EMPID TO DET-EMP-ID  
                    WRITE PRINTLINE FROM DETAIL-LINE AFTER
                       ADVANCING 1 LINE
                    READ TRANSFILE
                      AT END SET TRANS-EOF TO TRUE
                    END-READ					  
		    END-EVALUATE.
		  
	   0200-END. 
	   
	   
	   9000-END-PROGRAM.
           CLOSE EMPLOYEEFILE.	
		   CLOSE TRANSFILE.
           CLOSE NEWEMPFILE.		   
           CLOSE OUTPUTFILE.	   
           STOP RUN.
           
          END PROGRAM INSERTEMPLOYEES.
