       IDENTIFICATION DIVISION.
       PROGRAM-ID. READRELATIVE.
      * READS A RELATIVE FILE FROM A SEQUENTIAL FILE
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   
	   SELECT INPUTSTUDIOS ASSIGN TO "STUDIOSREL.DAT"
        FILE STATUS IS FILE-CHECK-KEY
		ORGANIZATION IS RELATIVE
		ACCESS MODE IS RANDOM
		RELATIVE KEY IS RRN-STUDIOS-KEY.
    
       DATA DIVISION.
       FILE SECTION.
	   FD INPUTSTUDIOS.
	   01 STUDIOSRECORD.
	      88 ENDOFFILE             VALUE HIGH-VALUES.
	      05 STUDIOSCODE          PIC 99.
		  05 STUDIOSNAME          PIC X(20).
		  05 STUDIOSADDRESS       PIC X(50).
		
       WORKING-STORAGE SECTION.
       01  WS-WORKING-STORAGE.
           05 FILLER               PIC X(27) VALUE 
		      'WORKING STORAGE STARTS HERE'.
     
   
	   01  WS-WORK-AREAS.
	       05  FILE-CHECK-KEY      PIC X(2).
		       88 RECORDFOUND      VALUE "00".
			   
		   05  RRN-STUDIOS-KEY    PIC 999.
		   
	       05  PRINTRECORD.
               10  PRTSTUDIOSCODE PIC BB99.
               10  PRTSTUDIOSNAME PIC BBX(20).
               10  PRTSTUDIOSADDR PIC BBX(50).

           05  READTYPE            PIC 9.
               88 DIRECTREAD       VALUE 1.
               88 SEQUENTIALREAD   VALUE 2.			   
		 

       PROCEDURE DIVISION.
       0100-START.

		   OPEN INPUT INPUTSTUDIOS.
		   DISPLAY "READ TYPE: DIRECT READ ENTER 1". 
		   DISPLAY "READ TYPE: SEQUENTIAL READ ENTER 2".
			  
		   ACCEPT READTYPE.
		   
		   IF DIRECTREAD 
		      DISPLAY "ENTER RELATIVE RECORD NUMBER: "
			    
			  ACCEPT RRN-STUDIOS-KEY
			  READ INPUTSTUDIOS
			    INVALID KEY DISPLAY "ERROR CODE: ",
				  FILE-CHECK-KEY
			  END-READ
			  PERFORM 0200-DISPLAY-RECORD
           END-IF.	

           IF SEQUENTIALREAD 
              READ INPUTSTUDIOS NEXT RECORD
                AT END SET ENDOFFILE TO TRUE
              END-READ
              PERFORM UNTIL ENDOFFILE   
                 PERFORM 0200-DISPLAY-RECORD
                 READ INPUTSTUDIOS NEXT RECORD 
                   AT END SET ENDOFFILE TO TRUE 
                 END-READ
			  END-PERFORM
			END-IF
			
			CLOSE INPUTSTUDIOS.
			STOP RUN.
				 
		   				
           READ INPUTSTUDIOS 
		     AT END SET ENDOFFILE TO TRUE
		   END-READ.
		   PERFORM 0200-DISPLAY-RECORD UNTIL
		      ENDOFFILE.
		 
		   PERFORM 9000-END-PROGRAM.
		   
	   0100-END.
	   
	   0200-DISPLAY-RECORD.
	       IF RECORDFOUND
		      MOVE STUDIOSCODE TO PRTSTUDIOSCODE
			  MOVE STUDIOSNAME TO PRTSTUDIOSNAME
			  MOVE STUDIOSADDRESS TO PRTSTUDIOSADDR
			  DISPLAY PRINTRECORD
		   END-IF.
	   0200-END.
		   
	   9000-END-PROGRAM.
           CLOSE INPUTSTUDIOS.    	   
		                 
           STOP RUN.
           
          END PROGRAM READRELATIVE.
