//UGBCBSRT JOB AF-1055,'COB SORT',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//JOBLIB   DD  DSN=SDAF.P732083.NAMI.LOADLIB,
//             DISP=SHR
//*
//STEP001  EXEC PGM=COBSORT
//INPUT01 DD DSN=SDAF.NANI.P732083.INPUT.SE,DISP=SHR
//OUTPUT01 DD DSN=SDAF.NANI.OUT.SE,DISP=OLD
//*SORT01 DD DSN=&&TEMP,DISP=(NEW,PASS,DELETE)
//SORT01   DD DISP=(NEW,DELETE),UNIT=SYSDA,SPACE=(CYL,(3335,3335))
//SYSOUT DD SYSOUT=*
