//UGB0RUNC JOB AF-1055,'SKIP 7RC',
//             MSGCLASS=X,MSGLEVEL=(1,1),
//             CLASS=P,NOTIFY=&SYSUID
//*
//JOBLIB   DD  DSN=SDAF.P732083.NAMI.LOADLIB,
//             DISP=SHR
//*
//STEP001  EXEC PGM=JOINRECS
//INDD     DD   DSN=SDAF.NANI.P732083.MOTHIN.SE,DISP=SHR
//OUTDD    DD   DSN=SDAF.NANI.OUT.SE,DISP=OLD
//SYSOUT   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//SYSABEND DD  SYSOUT=*
//SYSDBOUT DD  SYSOUT=*
//SYSIN    DD  *
S0
/*
//
