/* REXX SNIPPETS */
/*PULL EXAMPLE DEMONSTARTAION*/
DO I=1 TO 1000
   SAY 'ENTER YOUR NAME'

PULL NAME
SAY 'YOU HAVE ENTERED NAME AS :', /*CONTINUATION CHARATER*/
     NAME
/* SAY EXAMPLE */
/*STRING CONCATINATION*/
SAY 'HI' || " NALINI "
SAY "HI " "NALINI "
/* ACCESS THE REXX STACK */
/* WITH QUEUE WE CAN PASS DATA FROM ONE PROGRAM TO ANOTHER */
  QUEUE "HELLO!"
  PARSE PULL A      /* A CONTAINS "HELLO!" */
  SAY "ENTER VALUE FOR B"
  PARSE PULL B      /* B IS INPUT FROM THE USER */
  PUSH "67890"
  PUSH "12345"
  PARSE PULL C      /* C CONTAINS "12345" */
  SAY 'QUEUE "HELLO!"' 'PUSH "67890" ' 'PUSH "12345"'
  SAY 'PULL A =' A
  SAY 'PULL B =' B
  SAY 'PULL C =' C
  DELSTACK
/* THERE IS ONE ITEM LEFT ON THE STACK */
