       IDENTIFICATION DIVISION.
       PROGRAM-ID. CREATEINDEXFILE.
      * CREATE AN INDEXED FILE FROM A SEQUENTIAL FILE
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

	   SELECT MOVIEFILESEQ ASSIGN TO "MOVIESSEQ.DAT"
	     ORGANIZATION IS LINE SEQUENTIAL.
       
       SELECT MOVIEFILEIDX ASSIGN TO "MOVIESIDX.DAT"
        FILE STATUS IS FILE-CHECK-KEY
		ORGANIZATION IS INDEXED
		ACCESS MODE IS RANDOM
		RECORD KEY IS MOVIECODEIDX
		ALTERNATE RECORD KEY IS MOVIETITLEIDX
		   WITH DUPLICATES.

       DATA DIVISION.
       FILE SECTION.
	   FD MOVIEFILEIDX.
	   01 MOVIERECORDIDX.
	      05 MOVIECODEIDX         PIC 9(5).
		  05 MOVIETITLEIDX        PIC X(40).
		  05 MOVIESUPPCODEIDX     PIC 99.
	
       FD MOVIEFILESEQ.
	   01 MOVIERECORDSEQ.
	      88 ENDOFFILE      VALUE HIGH-VALUES.
	      05 MOVIECODESEQ         PIC 9(5).
		  05 MOVIETITLESEQ        PIC X(40).
		  05 MOVIESUPPCODESEQ     PIC 99.
	
		
       WORKING-STORAGE SECTION.
       01  WS-WORKING-STORAGE.
           05 FILLER      PIC X(27) VALUE 
		      'WORKING STORAGE STARTS HERE'.
   
	   01  WS-WORK-AREAS.
	       05  FILE-CHECK-KEY     PIC X(2).

       PROCEDURE DIVISION.
       0100-READ-MOVIES.

		   OPEN INPUT MOVIEFILESEQ.
		   OPEN OUTPUT MOVIEFILEIDX.
		   				
           READ MOVIEFILESEQ 
		     AT END SET ENDOFFILE TO TRUE
		   END-READ.
		   PERFORM 0200-PROCESS-FILE UNTIL
		      ENDOFFILE.
		 
		   PERFORM 9000-END-PROGRAM.
		   
	   0100-END.
	   
	   0200-PROCESS-FILE.
	  
		   WRITE MOVIERECORDIDX FROM MOVIERECORDSEQ
		      INVALID KEY DISPLAY 
			     "VIDEO STATUS = " FILE-CHECK-KEY
		   END-WRITE.
		   READ MOVIEFILESEQ
		      AT END SET ENDOFFILE TO TRUE.
		0200-END.
		   
	   9000-END-PROGRAM.
           CLOSE MOVIEFILESEQ, MOVIEFILEIDX. 
           STOP RUN.
           
          END PROGRAM CREATEINDEXFILE.
