       IDENTIFICATION DIVISION.
       PROGRAM-ID. READINDEXFILE.
      * READS AN INDEXED FILE USING EITHER VIDEO TITLE 
      *   OR 5 DIGIT VIDEO CODE
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   
	   SELECT MOVIEFILE ASSIGN TO "MOVIESIDX.DAT"
        FILE STATUS IS FILE-CHECK-KEY
		ORGANIZATION IS INDEXED
		ACCESS MODE IS DYNAMIC
		RECORD KEY IS MOVIECODE
		ALTERNATE RECORD KEY IS MOVIETITLE
		   WITH DUPLICATES.
		   
    
       DATA DIVISION.
       FILE SECTION.
	   FD MOVIEFILE.
	   01 MOVIERECORD.
	      88 ENDOFFILE             VALUE HIGH-VALUES.
	      05 MOVIECODE             PIC 9(5).
		  05 MOVIETITLE            PIC X(40).
		  05 SUPPLIERCODE          PIC 99.
		
       WORKING-STORAGE SECTION.
       01  WS-WORKING-STORAGE.
           05 FILLER               PIC X(27) VALUE 
		      'WORKING STORAGE STARTS HERE'.    
   
	   01  WS-WORK-AREAS.
	       05  FILE-CHECK-KEY      PIC X(2).
		       88 RECORDFOUND      VALUE "00".
			   
		   05  READTYPE            PIC 9.
		       88 MOVIECODEKEY     VALUE 1.
			   88 MOVIETITLEKEY    VALUE 2.
               88 ALLMOVIES        VALUE 3.
			   
	       05  PRINTRECORD.
               10  PRTMOVIECODE    PIC 99999.
               10  PRTMOVIETITLE   PIC BBBBX(40).

       PROCEDURE DIVISION.
       0100-START.

		   OPEN INPUT MOVIEFILE.
		   DISPLAY "SELECT RECORD BY VIDEO CODE, ENTER 1". 
		   DISPLAY "SELECT RECORD BY TITLE, ENTER 2".
			  
		   ACCEPT READTYPE.
		   
		   IF MOVIECODEKEY 
		      DISPLAY "ENTER VIDEO CODE KEY (5 DIGITS): " 
			    WITH NO ADVANCING		    
			  ACCEPT MOVIECODE
			  READ MOVIEFILE
			    KEY IS MOVIECODE
			    INVALID KEY DISPLAY "MOVIE STATUS: ",
				  FILE-CHECK-KEY
			  END-READ			 
           END-IF	

           IF MOVIETITLEKEY
		      DISPLAY "ENTER VIDEO TITLE (40 CHARACTERS): " 
			    WITH NO ADVANCING
			  ACCEPT MOVIETITLE
              READ MOVIEFILE
                KEY IS MOVIETITLE			  
                INVALID KEY DISPLAY "MOVIE STATUS: ",
				  FILE-CHECK-KEY
              END-READ
			END-IF.

			IF RECORDFOUND
			   MOVE MOVIECODE TO PRTMOVIECODE
			   MOVE MOVIETITLE TO PRTMOVIETITLE
			   DISPLAY PRINTRECORD
			END-IF.
			
			
		   PERFORM 9000-END-PROGRAM.
		   
	   0100-END.
	   
	 
	   9000-END-PROGRAM.
           CLOSE MOVIEFILE.    	   
		                 
           STOP RUN.
           
          END PROGRAM READINDEXFILE.
