       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRINGEXAMPLE.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
	   SELECT EMPLOYEEFILE ASSIGN TO "EMPLOYEES.DAT"
		ORGANIZATION IS LINE SEQUENTIAL.         
               
       DATA DIVISION.
       FILE SECTION.
	   FD EMPLOYEEFILE.
	   01 EMPDETAILS.
			88 ENDOFFILE VALUE HIGH-VALUES.
			02 EMPLOYEESSN  	 PIC 9(9).
			02 EMPLOYEENAME.
				03 LASTNAME	     PIC X(10).
				03 FIRSTNAME     PIC X(10).
				03 MIDDLEINIT    PIC X.
			02 BIRTHDATE.
				03 BIRTH-YEAR	 PIC 9(4).
				03 BIRTH-MONTH	 PIC 9(2).
				03 BIRTH-DAY	 PIC 9(2).
			02 GENDER       PIC X.
			
       WORKING-STORAGE SECTION.   
	   01  WS-WORKING-STORAGE.
	       05  FILLER  PIC X(27) VALUE 
		       'WORKING STORAGE STARTS HERE'.
		
			
	     01  WS-REPORT-TITLE.
           05  FILLER     PIC X(20) VALUE SPACES.
           05  FILLER     PIC X(33) 
		        VALUE 'EMPLOYEE LIST'.		   
       01  WS-HEADING-LINE.
	       05  FILLER     PIC X(30) VALUE 'NAME'.
		   05  FILLER     PIC X(11)  VALUE 'SSN'.


	   01  WS-DETAIL-LINE.
	       05  WS-DET-NAME   PIC X(23).
	
		   05  SSN-OUT            PIC 999B99B9999.
	

       PROCEDURE DIVISION.
       
	   0100-BEGIN.
		    
		   OPEN INPUT EMPLOYEEFILE.
		   READ EMPLOYEEFILE
			AT END SET ENDOFFILE TO TRUE
			END-READ.
		   DISPLAY WS-REPORT-TITLE.
		   DISPLAY WS-HEADING-LINE.	
		   DISPLAY ' '.
		   
           PERFORM 0200-PROCESS-RECORDS UNTIL ENDOFFILE.
		 
		   PERFORM 0300-STOP-RUN.
	   
	   0200-PROCESS-RECORDS.
		   
           MOVE EMPLOYEESSN TO SSN-OUT.
		   INSPECT SSN-OUT REPLACING ALL ' ' BY '-'.
           MOVE SPACES TO WS-DET-NAME.
           STRING FIRSTNAME DELIMITED BY SPACES ' '
		    DELIMITED BY SIZE MIDDLEINIT DELIMITED BY 
            SPACES '. ' DELIMITED BY SIZE 
			LASTNAME DELIMITED BY SPACES ' ' DELIMITED BY 
			SIZE INTO WS-DET-NAME.
	  
		   DISPLAY WS-DETAIL-LINE.
		   DISPLAY ' '.
		   READ EMPLOYEEFILE 
			 AT END SET ENDOFFILE TO TRUE
		   END-READ.
	   
	   0200-END.
	   
	   0300-STOP-RUN.	
		
           CLOSE EMPLOYEEFILE.		
           STOP RUN.
           
          END PROGRAM STRINGEXAMPLE.
